Revit 2026 API

# GeometryCreationUtilitiesCreateSweptBlendGeometry(Curve, IListDouble, IListCurveLoop, IListICollectionVertexPair, SolidOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateSweptBlendGeometry(
	Curve pathCurve,
	IList<double> pathParams,
	IList<CurveLoop> profileLoops,
	IList<ICollection<VertexPair>> vertexPairs,
	SolidOptions solidOptions
)
```
```vb
Public Shared Function CreateSweptBlendGeometry (
	pathCurve As Curve,
	pathParams As IList(Of Double),
	profileLoops As IList(Of CurveLoop),
	vertexPairs As IList(Of ICollection(Of VertexPair)),
	solidOptions As SolidOptions
) As Solid
```
```cpp
public:
static Solid^ CreateSweptBlendGeometry(
	Curve^ pathCurve,
	IList<double>^ pathParams,
	IList<CurveLoop^>^ profileLoops,
	IList<ICollection<VertexPair^>^>^ vertexPairs,
	SolidOptions^ solidOptions
)
```
```fsharp
static member CreateSweptBlendGeometry :
        pathCurve : Curve *
        pathParams : IList<float> *
        profileLoops : IList<CurveLoop> *
        vertexPairs : IList<ICollection<VertexPair>> *
        solidOptions : SolidOptions -> Solid
```

#### Parameters

pathCurve Curve

pathParams IListDouble

profileLoops IListCurveLoop

vertexPairs IListICollectionVertexPair

solidOptions SolidOptions

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateSweptBlendGeometry Overload

Autodesk.Revit.DB Namespace